export const xlsm_inte_keys_lua生成物遍表格_辅助表格 = [
"简陋武器LV1","白","攻击力+20","10%概率3倍范围伤害","初始获得"
];

export interface xlsm_inte_lua生成物遍表格_辅助表格 {
    [key: string]: {
        "简陋武器LV1"?: string;    // 名称
        "白"?: string;    // 字体颜色
        "攻击力+20"?: string;    // 属性
        "10%概率3倍范围伤害"?: string;    // nan
        "初始获得"?: string;    // 获得条件
    }
}

export const xlsm_data_lua生成物遍表格_辅助表格: xlsm_inte_lua生成物遍表格_辅助表格 = {
    "简陋武器LV2":{
        "简陋武器LV1": "简陋武器LV2",
        "白": "白",
        "攻击力+20": "攻击力+25",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "500金币升级"
    },
    "简陋武器LV3":{
        "简陋武器LV1": "简陋武器LV3",
        "白": "白",
        "攻击力+20": "攻击力+30",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "1000金币升级"
    },
    "简陋武器LV4":{
        "简陋武器LV1": "简陋武器LV4",
        "白": "白",
        "攻击力+20": "攻击力+35",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "1500金币升级"
    },
    "简陋武器LV5":{
        "简陋武器LV1": "简陋武器LV5",
        "白": "白",
        "攻击力+20": "攻击力+40",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "2000金币升级"
    },
    "普通武器LV1":{
        "简陋武器LV1": "普通武器LV1",
        "白": "蓝",
        "攻击力+20": "攻击力+60",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "简陋武器已经融合过白装后消耗4000金币召唤boss击杀升级"
    },
    "普通武器LV2":{
        "简陋武器LV1": "普通武器LV2",
        "白": "蓝",
        "攻击力+20": "攻击力+75",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "2500金币升级"
    },
    "普通武器LV3":{
        "简陋武器LV1": "普通武器LV3",
        "白": "蓝",
        "攻击力+20": "攻击力+90",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "3000金币升级"
    },
    "普通武器LV4":{
        "简陋武器LV1": "普通武器LV4",
        "白": "蓝",
        "攻击力+20": "攻击力+105",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "3500金币升级"
    },
    "普通武器LV5":{
        "简陋武器LV1": "普通武器LV5",
        "白": "蓝",
        "攻击力+20": "攻击力+120",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "4000金币升级"
    },
    "精良武器LV1":{
        "简陋武器LV1": "精良武器LV1",
        "白": "紫",
        "攻击力+20": "攻击力+180",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "普通武器已经融合过蓝装后消耗8000金币召唤BOSS击杀升级"
    },
    "精良武器LV2":{
        "简陋武器LV1": "精良武器LV2",
        "白": "紫",
        "攻击力+20": "攻击力+225",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "4500金币升级"
    },
    "精良武器LV3":{
        "简陋武器LV1": "精良武器LV3",
        "白": "紫",
        "攻击力+20": "攻击力+270",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "5000金币升级"
    },
    "精良武器LV4":{
        "简陋武器LV1": "精良武器LV4",
        "白": "紫",
        "攻击力+20": "攻击力+315",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "5500金币升级"
    },
    "精良武器LV5":{
        "简陋武器LV1": "精良武器LV5",
        "白": "紫",
        "攻击力+20": "攻击力+360",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "6000金币升级"
    },
    "极品武器LV1":{
        "简陋武器LV1": "极品武器LV1",
        "白": "橙",
        "攻击力+20": "攻击力+540",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "精良武器已经融合过橙装后消耗12000金币召唤BOSS击杀升级"
    },
    "极品武器LV2":{
        "简陋武器LV1": "极品武器LV2",
        "白": "橙",
        "攻击力+20": "攻击力+675",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "6500金币升级"
    },
    "极品武器LV3":{
        "简陋武器LV1": "极品武器LV3",
        "白": "橙",
        "攻击力+20": "攻击力+810",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "7000金币升级"
    },
    "极品武器LV4":{
        "简陋武器LV1": "极品武器LV4",
        "白": "橙",
        "攻击力+20": "攻击力+945",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "7500金币升级"
    },
    "极品武器LV5":{
        "简陋武器LV1": "极品武器LV5",
        "白": "橙",
        "攻击力+20": "攻击力+1080",
        "10%概率3倍范围伤害": "10%概率3倍范围伤害",
        "初始获得": "8000金币升级"
    },
    "蓝":{
        "简陋武器LV1": "|cff00ccff蓝"
    },
    "紫":{
        "简陋武器LV1": "|cffff00ff紫"
    },
    "橙色":{
        "简陋武器LV1": "|cffff6600橙色"
    },
    "装备品质":{
        "简陋武器LV1": "装备品质",
        "白": "名称",
        "攻击力+20": "效果"
    },
    "白":{
        "简陋武器LV1": "白",
        "白": "巨人腰带",
        "攻击力+20": "力量+20"
    },
    "白":{
        "简陋武器LV1": "白",
        "白": "红水晶",
        "攻击力+20": "生命值+800"
    },
    "白":{
        "简陋武器LV1": "白",
        "白": "铁斧",
        "攻击力+20": "攻击力+40"
    },
    "白":{
        "简陋武器LV1": "白",
        "白": "匕首",
        "攻击力+20": "攻击速度+15%"
    },
    "白":{
        "简陋武器LV1": "白",
        "白": "蓝水晶",
        "攻击力+20": "法力值+80"
    },
    "白":{
        "简陋武器LV1": "白",
        "白": "桃木枝",
        "攻击力+20": "技能强度+0.2"
    },
    "蓝":{
        "简陋武器LV1": "蓝",
        "白": "强身护腕",
        "攻击力+20": "力量+90"
    },
    "蓝":{
        "简陋武器LV1": "蓝",
        "白": "护身甲",
        "攻击力+20": "护甲+2",
        "初始获得": "生命回复+1%"
    },
    "蓝":{
        "简陋武器LV1": "蓝",
        "白": "亮银枪",
        "攻击力+20": "攻击+180"
    },
    "蓝":{
        "简陋武器LV1": "蓝",
        "白": "虎爪",
        "攻击力+20": "攻击+120",
        "初始获得": "敏捷+60"
    },
    "蓝":{
        "简陋武器LV1": "蓝",
        "白": "智慧之冠",
        "攻击力+20": "智力+60",
        "初始获得": "法力回复+2%"
    },
    "蓝":{
        "简陋武器LV1": "蓝",
        "白": "顺风斗篷",
        "攻击力+20": "移速+25%",
        "初始获得": "闪避+5%"
    },
    "紫":{
        "简陋武器LV1": "紫",
        "白": "祝福项链",
        "攻击力+20": "三围+60",
        "初始获得": "生命回复+2%"
    },
    "紫":{
        "简陋武器LV1": "紫",
        "白": "嗜血扳指",
        "攻击力+20": "吸血+10%",
        "初始获得": "杀敌5%+1随机属性"
    },
    "紫":{
        "简陋武器LV1": "紫",
        "白": "震荡板甲",
        "攻击力+20": "护甲+3",
        "初始获得": "反伤15%"
    },
    "紫":{
        "简陋武器LV1": "紫",
        "白": "切割者",
        "攻击力+20": "攻击+360",
        "初始获得": "使被攻击者进入流血状态，每秒造成攻击*0.2的伤害持续3s"
    },
    "紫":{
        "简陋武器LV1": "紫",
        "白": "聚能法袍",
        "攻击力+20": "技能强度+0.5",
        "初始获得": "每次释放技能对周围敌人造成智力*3的伤害"
    },
    "紫":{
        "简陋武器LV1": "紫",
        "白": "劈山刀",
        "攻击力+20": "攻击+360",
        "初始获得": "25%范围伤害"
    },
    "橙":{
        "简陋武器LV1": "橙",
        "白": "圣灵珠",
        "攻击力+20": "三围+180，",
        "初始获得": "每0.5s自动攻击周围敌人一次，造成三围*1的伤害"
    },
    "橙":{
        "简陋武器LV1": "橙",
        "白": "流影镜",
        "攻击力+20": "三围+180，",
        "初始获得": "主动技能分身：分裂一个与自己一模一样的镜像，造成50%伤害，承受200%伤害"
    },
    "橙":{
        "简陋武器LV1": "橙",
        "白": "龙牙刺",
        "攻击力+20": "攻击力+1080",
        "初始获得": "暴击率+10%"
    },
    "橙":{
        "简陋武器LV1": "橙",
        "白": "胜利之剑",
        "攻击力+20": "攻击力+1080",
        "初始获得": "攻速+50%"
    },
    "橙":{
        "简陋武器LV1": "橙",
        "白": "铁壁",
        "攻击力+20": "减伤20%",
        "初始获得": "生命值+21600"
    },
    "橙":{
        "简陋武器LV1": "橙",
        "白": "贤者之书",
        "攻击力+20": "智力+540",
        "初始获得": "法力值+2160"
    },
    "名称":{
        "简陋武器LV1": "名称",
        "白": "字体颜色",
        "攻击力+20": "属性"
    },
    "简陋防具LV1":{
        "简陋武器LV1": "简陋防具LV1",
        "白": "白",
        "攻击力+20": "护甲+1",
        "10%概率3倍范围伤害": "生命值+400"
    },
    "简陋防具LV2":{
        "简陋武器LV1": "简陋防具LV2",
        "白": "白",
        "攻击力+20": "护甲+1",
        "10%概率3倍范围伤害": "生命值+500"
    },
    "简陋防具LV3":{
        "简陋武器LV1": "简陋防具LV3",
        "白": "白",
        "攻击力+20": "护甲+1",
        "10%概率3倍范围伤害": "生命值+600"
    },
    "简陋防具LV4":{
        "简陋武器LV1": "简陋防具LV4",
        "白": "白",
        "攻击力+20": "护甲+1",
        "10%概率3倍范围伤害": "生命值+700"
    },
    "简陋防具LV5":{
        "简陋武器LV1": "简陋防具LV5",
        "白": "白",
        "攻击力+20": "护甲+1",
        "10%概率3倍范围伤害": "生命值+800"
    },
    "普通防具LV1":{
        "简陋武器LV1": "普通防具LV1",
        "白": "蓝",
        "攻击力+20": "护甲+2",
        "10%概率3倍范围伤害": "生命值+1200"
    },
    "普通防具LV2":{
        "简陋武器LV1": "普通防具LV2",
        "白": "蓝",
        "攻击力+20": "护甲+2",
        "10%概率3倍范围伤害": "生命值+1500"
    },
    "普通防具LV3":{
        "简陋武器LV1": "普通防具LV3",
        "白": "蓝",
        "攻击力+20": "护甲+2",
        "10%概率3倍范围伤害": "生命值+1800"
    },
    "普通防具LV4":{
        "简陋武器LV1": "普通防具LV4",
        "白": "蓝",
        "攻击力+20": "护甲+2",
        "10%概率3倍范围伤害": "生命值+2100"
    },
    "普通防具LV5":{
        "简陋武器LV1": "普通防具LV5",
        "白": "蓝",
        "攻击力+20": "护甲+2",
        "10%概率3倍范围伤害": "生命值+2400"
    },
    "精良防具LV1":{
        "简陋武器LV1": "精良防具LV1",
        "白": "紫",
        "攻击力+20": "护甲+3",
        "10%概率3倍范围伤害": "生命值+3600"
    },
    "精良防具LV2":{
        "简陋武器LV1": "精良防具LV2",
        "白": "紫",
        "攻击力+20": "护甲+3",
        "10%概率3倍范围伤害": "生命值+4500"
    },
    "精良防具LV3":{
        "简陋武器LV1": "精良防具LV3",
        "白": "紫",
        "攻击力+20": "护甲+3",
        "10%概率3倍范围伤害": "生命值+5400"
    },
    "精良防具LV4":{
        "简陋武器LV1": "精良防具LV4",
        "白": "紫",
        "攻击力+20": "护甲+3",
        "10%概率3倍范围伤害": "生命值+6300"
    },
    "精良防具LV5":{
        "简陋武器LV1": "精良防具LV5",
        "白": "紫",
        "攻击力+20": "护甲+3",
        "10%概率3倍范围伤害": "生命值+7200"
    },
    "极品防具LV1":{
        "简陋武器LV1": "极品防具LV1",
        "白": "橙",
        "攻击力+20": "护甲+4",
        "10%概率3倍范围伤害": "生命值+10800"
    },
    "极品防具LV2":{
        "简陋武器LV1": "极品防具LV2",
        "白": "橙",
        "攻击力+20": "护甲+4",
        "10%概率3倍范围伤害": "生命值+13500"
    },
    "极品防具LV3":{
        "简陋武器LV1": "极品防具LV3",
        "白": "橙",
        "攻击力+20": "护甲+4",
        "10%概率3倍范围伤害": "生命值+16200"
    },
    "极品防具LV4":{
        "简陋武器LV1": "极品防具LV4",
        "白": "橙",
        "攻击力+20": "护甲+4",
        "10%概率3倍范围伤害": "生命值+18900"
    },
    "极品防具LV5":{
        "简陋武器LV1": "极品防具LV5",
        "白": "橙",
        "攻击力+20": "护甲+4",
        "10%概率3倍范围伤害": "生命值+21600"
    },
};

export class xlsm_lua生成物遍表格_辅助表格 {
    static Start() {
        const data=xlsm_data_lua生成物遍表格_辅助表格;
    }
}
