export const xlsx_inte_keys_table_e3349c84-582b-4f32-8273-421ac3ac6778_mallitem = [
"物品名称","品级","道具类型","消耗类型","地图变量","会员特权","道具说明","是否拥有","拥有数量","价格"
];

export interface xlsx_inte_table_e3349c84-582b-4f32-8273-421ac3ac6778_mallitem {
    [key: string]: {
        "物品名称"?: string;    // 物品名称
        "品级"?: string;    // 品级
        "道具类型"?: string;    // 道具类型
        "消耗类型"?: number;    // 消耗类型
        "地图变量"?: string;    // 地图变量
        "会员特权"?: number;    // 会员特权
        "道具说明"?: string;    // 道具说明
        "是否拥有"?: boolean;    // 是否拥有
        "拥有数量"?: number;    // 拥有数量
        "价格"?: number;    // 价格
    }
}

export const xlsx_data_table_e3349c84-582b-4f32-8273-421ac3ac6778_mallitem: xlsx_inte_table_e3349c84-582b-4f32-8273-421ac3ac6778_mallitem = {
    "测试1":{
        "物品名称": "测试1",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP001",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 100
    },
    "测试2":{
        "物品名称": "测试2",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP002",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 110
    },
    "测试3":{
        "物品名称": "测试3",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP003",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 120
    },
    "测试4":{
        "物品名称": "测试4",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP004",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 130
    },
    "测试5":{
        "物品名称": "测试5",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP005",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 140
    },
    "测试6":{
        "物品名称": "测试6",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP006",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 150
    },
    "测试7":{
        "物品名称": "测试7",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP007",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 160
    },
    "测试8":{
        "物品名称": "测试8",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP008",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 170
    },
    "测试9":{
        "物品名称": "测试9",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP009",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 180
    },
    "测试10":{
        "物品名称": "测试10",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP010",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 190
    },
    "测试11":{
        "物品名称": "测试11",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP011",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 200
    },
    "测试12":{
        "物品名称": "测试12",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP012",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 210
    },
    "测试13":{
        "物品名称": "测试13",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP013",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 220
    },
    "测试14":{
        "物品名称": "测试14",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP014",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 230
    },
    "测试15":{
        "物品名称": "测试15",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP015",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 240
    },
    "测试16":{
        "物品名称": "测试16",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP016",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 250
    },
    "测试17":{
        "物品名称": "测试17",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP017",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 260
    },
    "测试18":{
        "物品名称": "测试18",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP018",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 270
    },
    "测试19":{
        "物品名称": "测试19",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP019",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 280
    },
    "测试20":{
        "物品名称": "测试20",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP020",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 290
    },
    "测试21":{
        "物品名称": "测试21",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP021",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 300
    },
    "测试22":{
        "物品名称": "测试22",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP022",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 310
    },
    "测试23":{
        "物品名称": "测试23",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP023",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 320
    },
    "测试24":{
        "物品名称": "测试24",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP024",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 330
    },
    "测试25":{
        "物品名称": "测试25",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP025",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 340
    },
    "测试26":{
        "物品名称": "测试26",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP026",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 350
    },
    "测试27":{
        "物品名称": "测试27",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP027",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 360
    },
    "测试28":{
        "物品名称": "测试28",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP028",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 370
    },
    "测试29":{
        "物品名称": "测试29",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP029",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 380
    },
    "测试30":{
        "物品名称": "测试30",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP030",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 390
    },
    "测试31":{
        "物品名称": "测试31",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP031",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 400
    },
    "测试32":{
        "物品名称": "测试32",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP032",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 410
    },
    "测试33":{
        "物品名称": "测试33",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP033",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 420
    },
    "测试34":{
        "物品名称": "测试34",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP034",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 430
    },
    "测试35":{
        "物品名称": "测试35",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP035",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 440
    },
    "测试36":{
        "物品名称": "测试36",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP036",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 450
    },
    "测试37":{
        "物品名称": "测试37",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP037",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 460
    },
    "测试38":{
        "物品名称": "测试38",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP038",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 470
    },
    "测试39":{
        "物品名称": "测试39",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP039",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 480
    },
    "测试40":{
        "物品名称": "测试40",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP040",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 490
    },
    "测试41":{
        "物品名称": "测试41",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP041",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 500
    },
    "测试42":{
        "物品名称": "测试42",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP042",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 510
    },
    "测试43":{
        "物品名称": "测试43",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP043",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 520
    },
    "测试44":{
        "物品名称": "测试44",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP044",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 530
    },
    "测试45":{
        "物品名称": "测试45",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP045",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 540
    },
    "测试46":{
        "物品名称": "测试46",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP046",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 550
    },
    "测试47":{
        "物品名称": "测试47",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP047",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 560
    },
    "测试48":{
        "物品名称": "测试48",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP048",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 570
    },
    "测试49":{
        "物品名称": "测试49",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP049",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 580
    },
    "测试50":{
        "物品名称": "测试50",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP050",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 590
    },
    "测试51":{
        "物品名称": "测试51",
        "品级": "N",
        "道具类型": "other",
        "消耗类型": 1,
        "地图变量": "SP051",
        "会员特权": 0,
        "道具说明": "测试",
        "是否拥有": false,
        "拥有数量": 1,
        "价格": 600
    },
};

export class xlsx_table_e3349c84-582b-4f32-8273-421ac3ac6778_mallitem {
    static Start() {
        const data=xlsx_data_table_e3349c84-582b-4f32-8273-421ac3ac6778_mallitem;
    }
}
